-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: fuadmin
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `mall_product`
--

DROP TABLE IF EXISTS `mall_product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `mall_product` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `price` decimal(10,2) NOT NULL,
  `number` int NOT NULL,
  `user_id` int NOT NULL,
  `name` varchar(128) NOT NULL,
  `description` varchar(256) NOT NULL,
  `img_url` varchar(100) DEFAULT NULL,
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `categoryName` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mall_product`
--

LOCK TABLES `mall_product` WRITE;
/*!40000 ALTER TABLE `mall_product` DISABLE KEYS */;
INSERT INTO `mall_product` VALUES (1,330.00,1500,1,'8/10kg洗衣机全自动家用租房小型波轮大容量带烘干洗烘一体12公斤','8/10kg洗衣机全自动家用租房小型波轮大容量带烘干洗烘一体12公斤','images/20240314/20240314152610787951_1.jpg','2024-03-14 07:28:51','清洁电器'),(2,209.00,2566,1,'荣事达吸尘器家用大吸力小型车用强力大功率装修美缝工业吸尘机','荣事达吸尘器家用大吸力小型车用强力大功率装修美缝工业吸尘机','images/20240314/20240314152914344422_2.jpg','2024-03-14 07:30:19','清洁电器/厨房电器'),(3,23.90,15678,1,'万利达电热水壶家用304不锈钢烧水壶保温一体宿舍智能恒温开水壶','万利达电热水壶家用304不锈钢烧水壶保温一体宿舍智能恒温开水壶','images/20240314/20240314153441209719_3.jpg','2024-03-14 07:35:11','厨房电器/电暖器具'),(4,398.00,1256,1,'扬子洗衣机全自动家用波轮洗脱一体洗衣机小型出租房用宿舍10公斤','扬子洗衣机全自动家用波轮洗脱一体洗衣机小型出租房用宿舍10公斤','images/20240314/20240314153540379398_4.jpg','2024-03-14 07:36:02','清洁电器'),(5,418.00,1234,1,'中国扬子电器出品洗衣机全自动家用10KG小型出租房屋宿舍洗脱一体','中国扬子电器出品洗衣机全自动家用10KG小型出租房屋宿舍洗脱一体','images/20240314/20240314153632175277_5.jpg','2024-03-14 07:36:57','清洁电器'),(6,32.00,4778,1,'内衣裤折叠洗衣机迷你小型自动婴儿洗衣机宿舍专用洗袜子神器便携','内衣裤折叠洗衣机迷你小型自动婴儿洗衣机宿舍专用洗袜子神器便携','images/20240314/20240314153743486989_6.jpg','2024-03-14 07:38:03','清洁电器/其他电器'),(7,79.00,9876,1,'飞科吹风机家用大功率负离子恒温速干护发电吹风学生宿舍用风筒机','飞科吹风机家用大功率负离子恒温速干护发电吹风学生宿舍用风筒机','images/20240314/20240314153831428646_7.jpg','2024-03-14 07:38:57','清洁电器/其他电器/电暖器具'),(8,33.00,456,1,'折叠迷你洗衣机小型洗袜子神器内衣内裤家用洗脱一体洗袜子机家用','折叠迷你洗衣机小型洗袜子神器内衣内裤家用洗脱一体洗袜子机家用','images/20240314/20240314153925396071_8.jpg','2024-03-14 07:39:40','清洁电器/其他电器/电暖器具'),(9,89.00,256,1,'红双喜干衣机烘干机家用烘衣服小型烘衣机速干可折叠风干机宿舍CW','红双喜干衣机烘干机家用烘衣服小型烘衣机速干可折叠风干机宿舍CW','images/20240314/20240314154010802805_9.jpg','2024-03-14 07:40:24','清洁电器/其他电器/电暖器具'),(10,218.00,786,1,'好太太大吸力抽油烟机家用厨房双电机排油机出租房小型侧吸油烟机','好太太大吸力抽油烟机家用厨房双电机排油机出租房小型侧吸油烟机','images/20240314/20240314154152873568_10.jpg','2024-03-14 07:42:13','清洁电器/其他电器/电暖器具/厨房电器'),(11,189.00,123,1,'内衣裤洗衣机内裤洗袜机小型全自动迷你微型分桶专用洗袜子神器','内衣裤洗衣机内裤洗袜机小型全自动迷你微型分桶专用洗袜子神器','images/20240314/20240314154304272414_11.jpg','2024-03-14 07:43:22','清洁电器/其他电器/电暖器具'),(12,30.00,0,1,'饮水机台式小型家用全自动智能迷你冷热两用桌面桶装水宿舍办公室','饮水机台式小型家用全自动智能迷你冷热两用桌面桶装水宿舍办公室','images/20240314/20240314154402563605_12.jpg','2024-03-14 07:44:19','清洁电器/其他电器/电暖器具/厨房电器/制冷电器'),(13,28.90,986,1,'万利达电热水壶保温一体大容量快烧水壶学生宿舍自动断电热壶家用','万利达电热水壶保温一体大容量快烧水壶学生宿舍自动断电热壶家用','images/20240314/20240314154452760705_13.jpg','2024-03-14 07:45:14','其他电器/电暖器具/厨房电器'),(14,247.00,1256,1,'智能数显仪表4-20ma导轨壁挂式数字显示温度压力水位液位控制DN10','智能数显仪表4-20ma导轨壁挂式数字显示温度压力水位液位控制DN10','images/20240314/20240314154611575473_14.jpg','2024-03-14 07:46:31','声像电器/其他电器/厨房电器'),(15,68.00,1456,1,'虹润温控器 数显智能温控仪工业温度控制器pid温控表恒温恒压A300','虹润温控器 数显智能温控仪工业温度控制器pid温控表恒温恒压A300','images/20240314/20240314154706320911_15.jpg','2024-03-14 07:47:16','声像电器/其他电器/厨房电器'),(16,3970.00,1256,1,'索威 M8 专业有源同轴音箱发烧HIFI蜂巢散热声像定位客厅电脑音箱','索威 M8 专业有源同轴音箱发烧HIFI蜂巢散热声像定位客厅电脑音箱','images/20240314/20240314154751232869_16.jpg','2024-03-14 07:48:09','声像电器/其他电器'),(17,2800.00,241,1,'360磁光美容院专用OPT808冰点仪器810洗眉一体机无创黑科技','360磁光美容院专用OPT808冰点仪器810洗眉一体机无创黑科技','images/20240314/20240314154859787169_17.jpg','2024-03-14 07:49:21','整容保健电器/其他电器'),(18,53.00,246,1,'煎药壶全自动熬药多功能通用底座分体式炖汤药定时预约家用电陶炉','煎药壶全自动熬药多功能通用底座分体式炖汤药定时预约家用电陶炉','images/20240314/20240314154953728142_18.jpg','2024-03-14 07:50:10','整容保健电器/其他电器'),(19,3449.00,456,1,'【1台也优惠】美的空调大1.5匹酷省电新一级变频冷暖卧室家用挂机','【1台也优惠】美的空调大1.5匹酷省电新一级变频冷暖卧室家用挂机','images/20240314/20240314155102732577_19.jpg','2024-03-14 07:51:18','其他电器/制冷电器/空调器/电暖器具'),(20,19799.00,41,1,'大金空调旗舰官方官网大3匹变频1级能效客厅冷暖柜机帕蒂能F172机','大金空调旗舰官方官网大3匹变频1级能效客厅冷暖柜机帕蒂能F172机','images/20240314/20240314155200251745_20.jpg','2024-03-14 07:52:20','其他电器/制冷电器/空调器/电暖器具'),(21,2999.00,785,1,'华凌空调挂机1.5匹新一级能效大风口家用变频智能冷暖35HL1Pro','华凌空调挂机1.5匹新一级能效大风口家用变频智能冷暖35HL1Pro','images/20240314/20240314155252193933_21.jpg','2024-03-14 07:53:04','其他电器/制冷电器/空调器/电暖器具'),(22,148.00,567,1,'空调扇移动小空调家用静音制冷小空调不加水卧室小型一体机电风扇','空调扇移动小空调家用静音制冷小空调不加水卧室小型一体机电风扇','images/20240314/20240314155350535025_22.jpg','2024-03-14 07:54:04','其他电器/制冷电器/空调器/电暖器具'),(23,249.00,789,1,'骆驼取暖器冷暖两用空调扇家用制冷速热神器节能省电暖气冷暖风机','骆驼取暖器冷暖两用空调扇家用制冷速热神器节能省电暖气冷暖风机','images/20240314/20240314155445230129_23.jpg','2024-03-14 07:54:55','其他电器/制冷电器/空调器/电暖器具'),(24,319.00,156,1,'冷暖两用空调扇制冷风机一体机家用静音神器移动水冷风扇小型空调','冷暖两用空调扇制冷风机一体机家用静音神器移动水冷风扇小型空调','images/20240314/20240314155548458753_24.jpg','2024-03-14 07:56:01','制冷电器/空调器/电暖器具'),(25,208.00,1478,1,'冷暖两用空调扇暖风机壁挂式制热一体机卧室静音省电可移动小空调','冷暖两用空调扇暖风机壁挂式制热一体机卧室静音省电可移动小空调','images/20240314/20240314155633999234_25.jpg','2024-03-14 07:56:51','制冷电器/空调器/电暖器具'),(26,1998.75,654,1,'奥克斯空调大1/1.5匹p一三级变频壁挂机式2/3匹p冷暖省电官方旗舰','奥克斯空调大1/1.5匹p一三级变频壁挂机式2/3匹p冷暖省电官方旗舰','images/20240314/20240314155726110084_26.jpg','2024-03-14 07:57:44','制冷电器/空调器/电暖器具'),(27,179.00,446,1,'康佳空调扇制冷风扇加水冷风机冷气扇家用宿舍神器移动小型空调扇','康佳空调扇制冷风扇加水冷风机冷气扇家用宿舍神器移动小型空调扇','images/20240314/20240314155822537779_27.jpg','2024-03-14 07:58:32','制冷电器/空调器/电暖器具'),(28,278.00,159,1,'骆驼空调扇冷暖两用取暖器家用制冷速热立式负离子石墨烯冷暖风机','骆驼空调扇冷暖两用取暖器家用制冷速热立式负离子石墨烯冷暖风机','images/20240314/20240314155904572797_28.jpg','2024-03-14 07:59:14','制冷电器/空调器/电暖器具'),(29,388.00,1590,1,'工业冷风机大型水空调扇室外加水制冷风扇喷雾冷气扇厂房降温神器','工业冷风机大型水空调扇室外加水制冷风扇喷雾冷气扇厂房降温神器','images/20240314/20240314155945191046_29.jpg','2024-03-14 07:59:57','制冷电器/空调器/电暖器具'),(30,218.00,445,1,'好太太双电机抽油烟机家用厨房大吸力排油机自清洗小型侧吸油烟机','好太太双电机抽油烟机家用厨房大吸力排油机自清洗小型侧吸油烟机','images/20240314/20240314160042598790_30.jpg','2024-03-14 08:00:59','厨房电器/清洁电器'),(31,27.57,364,1,'特价万利达双层防烫烧水壶不锈钢全自动断电保温泡茶煮电热开水壶','特价万利达双层防烫烧水壶不锈钢全自动断电保温泡茶煮电热开水壶','images/20240314/20240314160131396649_31.jpg','2024-03-14 08:02:02','厨房电器'),(32,69.90,456,1,'正品半球3500W大功率电磁炉家用 爆炒防水触摸火锅多功能套装炉灶','正品半球3500W大功率电磁炉家用 爆炒防水触摸火锅多功能套装炉灶','images/20240314/20240314160228548780_32.jpg','2024-03-14 08:02:38','厨房电器'),(33,88.00,249,1,'扬子蜂窝电炒锅多功能家用电热锅蒸煮一体式炒菜不粘电锅电煮锅','扬子蜂窝电炒锅多功能家用电热锅蒸煮一体式炒菜不粘电锅电煮锅','images/20240314/20240314160525834522_33.jpg','2024-03-14 08:05:34','厨房电器'),(34,39.90,459,1,'奥卡恩筷子消毒机厨房家用小型智能紫外线充电式消毒壁挂式快子筒','奥卡恩筷子消毒机厨房家用小型智能紫外线充电式消毒壁挂式快子筒','images/20240314/20240314160605437050_34.jpg','2024-03-14 08:06:20','厨房电器/清洁电器'),(35,49.00,4599,1,'电炒锅多功能家用铸铁电热锅电炒菜锅爆炒一体式插电电煮锅涮火锅','电炒锅多功能家用铸铁电热锅电炒菜锅爆炒一体式插电电煮锅涮火锅','images/20240314/20240314160656157833_35.jpg','2024-03-14 08:07:14','厨房电器/电暖器具'),(36,39.00,569,1,'电饭煲家用1一2人多功能蒸煮两用迷你小型一人单小电饭锅煮饭锅','电饭煲家用1一2人多功能蒸煮两用迷你小型一人单小电饭锅煮饭锅','images/20240314/20240314160740379887_36.jpg','2024-03-14 08:08:07','厨房电器/电暖器具'),(37,99.00,478,1,'抽烟机家用厨房大吸力农村抽油烟机商用强力柴火灶土灶用吸油机','抽烟机家用厨房大吸力农村抽油烟机商用强力柴火灶土灶用吸油机','images/20240314/20240314160852147124_37.jpg','2024-03-14 08:09:04','厨房电器/清洁电器'),(38,119.00,119,1,'消毒碗柜家用小型厨房碗碟收纳架杯子奶瓶免沥水烘干台式紫外线','消毒碗柜家用小型厨房碗碟收纳架杯子奶瓶免沥水烘干台式紫外线','images/20240314/20240314161532400671_38.jpg','2024-03-14 08:15:48','厨房电器/清洁电器'),(39,59.00,59,1,'EIT电饭煲1一2一3人家用智能多功能可蒸煮煮饭锅迷你小型小电饭锅','EIT电饭煲1一2一3人家用智能多功能可蒸煮煮饭锅迷你小型小电饭锅','images/20240314/20240314161620722057_39.jpg','2024-03-14 08:16:28','厨房电器/清洁电器'),(40,126.00,126,1,'半球抽油烟机大吸力小型老式厨房家用租房抽烟机吸油畑姻老款排','半球抽油烟机大吸力小型老式厨房家用租房抽烟机吸油畑姻老款排','images/20240314/20240314161658984896_40.jpg','2024-03-14 08:17:13','厨房电器/清洁电器'),(41,2880.00,2465,1,'意大利水暖取暖器对流式墙暖卧室电暖气片壁挂式暖风机水电暖器','意大利水暖取暖器对流式墙暖卧室电暖气片壁挂式暖风机水电暖器','images/20240314/20240314161755274228_41.jpg','2024-03-14 08:18:10','其他电器/电暖器具/空调器'),(42,198.00,785,1,'暖风机取暖器家用节能省电石墨烯电加热冬天暖气办公室浴室烤火炉','暖风机取暖器家用节能省电石墨烯电加热冬天暖气办公室浴室烤火炉','images/20240314/20240314161835448087_42.jpg','2024-03-14 08:18:51','电暖器具/空调器'),(43,798.00,423,1,'托玛琳床垫锗石沙发垫加热垫保暖保健汗蒸垫电热垫排寒养生','托玛琳床垫锗石沙发垫加热垫保暖保健汗蒸垫电热垫排寒养生','images/20240314/20240314161928424047_43.jpg','2024-03-14 08:19:43','电暖器具'),(44,228.00,4956,1,'可爱充电暖脚宝足底按摩器揉捏暖脚神器家用桌下取暖器冬季暖脚器','可爱充电暖脚宝足底按摩器揉捏暖脚神器家用桌下取暖器冬季暖脚器','images/20240314/20240314162025217915_44.jpg','2024-03-14 08:20:36','电暖器具'),(45,11.70,963,1,'围炉煮茶烧烤火炉子聚全套装工器具桌炭火盆户外家庭用室内冬天日','围炉煮茶烧烤火炉子聚全套装工器具桌炭火盆户外家庭用室内冬天日','images/20240314/20240314162103892166_45.jpg','2024-03-14 08:21:15','电暖器具/厨房电器'),(46,160.00,442,1,'虹润配电器模拟量输出4-20mA隔离器一进二出分配信号隔离模块M23','虹润配电器模拟量输出4-20mA隔离器一进二出分配信号隔离模块M23','images/20240314/20240314162155450433_46.jpg','2024-03-14 08:22:08','其他电器'),(47,40.91,963,1,'家用电饭锅1-2人多功能3L4迷你小型5-6人智能煮饭学生宿舍电饭煲','家用电饭锅1-2人多功能3L4迷你小型5-6人智能煮饭学生宿舍电饭煲','images/20240314/20240314162246894735_47.jpg','2024-03-14 08:22:59','其他电器/厨房电器'),(48,458.00,997,1,'Play 00:05 00:59   艾丁新款共振音箱远程播放控制蓝牙震动发声骨传导音响APP遥控U盘','Play\n00:05\n00:59\n\n\n艾丁新款共振音箱远程播放控制蓝牙震动发声骨传导音响APP遥控U盘','images/20240314/20240314162336880067_48.jpg','2024-03-14 08:23:48','声像电器'),(49,549.00,362,1,'Divoom点音蓝牙音箱小型家庭KTV麦克风小魔女k歌音响女唱歌话筒','Divoom点音蓝牙音箱小型家庭KTV麦克风小魔女k歌音响女唱歌话筒','images/20240314/20240314162415218781_49.jpg','2024-03-14 08:24:30','声像电器'),(50,34.00,663,1,'笔记本电脑小音响台式机桌面USB多媒体小音箱办公室迷超重低音炮','笔记本电脑小音响台式机桌面USB多媒体小音箱办公室迷超重低音炮','images/20240314/20240314162511372464_50.jpg','2024-03-14 08:25:22','声像电器');
/*!40000 ALTER TABLE `mall_product` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-03-14 16:32:18
